# Дано пятизначное или шестизначное натуральное число.
# Напишите программу, которая изменит порядок его последних пяти цифр на обратный.
# x = input()
# try:
#     print(int(x[:len(x) - 5] + x[-1:-6:-1]))
# except ValueError:
#     print('Вы ввели символ, а надо число')
from typing import List

# № 2
# languages = {'Python': 'Гвидо ван Россум',
#              'C#': 'Андерс Хейлсберг',
#              'Java': 'Джеймс Гослинг',
#              'C++': 'Бьёрн Страуструп'}
# s = input('Введите язык програмирования: ').title()
# try:
#     print(f'Создателем языка {s} является', languages[s])
# except KeyError:
#     print(f'У вас не получилось , попробуйте ввести что-то из предложенных вариантов {[key for key in languages]}')

